Repository: pypi-data/pypi-mirror-376
Catalog: packages/duplicity/duplicity-3.0.6.dev8.tar.gz/duplicity-3.0.6.dev8/po/*.po
Languages: el_gr

source: INT intercepted...exiting.
el_gr: INT υποκλοπή... έξοδος.

source: GPG error detail: %s
el_gr: Λεπτομέρειες σφάλματος GPG: %s

source: User error detail: %s
el_gr: Λεπτομέρειες σφάλματος χρήστη: %s

source: Backend error detail: %s
el_gr: Λεπτομέρειες σφάλματος διαχείρισης: %s

source: usage:
el_gr: χρήση:

source: .__call__() not defined
el_gr: . Δεν έχει οριστεί__call__()

source: conflicting subparser: %s
el_gr: συγκρουόμενος υποαναλυτής: %s

source: unknown parser %(parser_name)r (choices: %(choices)s)
el_gr: άγνωστος parser %(parser_name)r (επιλογές: %(choices)s)

source: argument "-" with mode %r
el_gr: όρισμα "-" με λειτουργία %r

source: can't open '%(filename)s': %(error)s
el_gr: δεν μπορεί να ανοίξει το '%(filename)s': %(error)s

source: cannot merge actions - two groups are named %r
el_gr: δεν είναι δυνατή η συγχώνευση ενεργειών - δύο ομάδες ονομάζονται %r

source: 'required' is an invalid argument for positionals
el_gr: 'απαιτείται' είναι ένα μη έγκυρο όρισμα για θέσεις

source: invalid option string %(option)r: must start with a character %(prefix_chars)r
el_gr: μη έγκυρη συμβολοσειρά επιλογής %(option)r: πρέπει να ξεκινά με χαρακτήρα %(prefix_chars)r

source: dest= is required for options like %r
el_gr: dest= απαιτείται για επιλογές όπως το %r

source: invalid conflict_resolution value: %r
el_gr: μη έγκυρη τιμή σύγκρουσης_ανάλυσης: %r

source: conflicting option string: %s
el_gr: συμβολοσειρά επιλογής σε διένεξη: %s

source: mutually exclusive arguments must be optional
el_gr: τα αμοιβαία αποκλειστικά επιχειρήματα πρέπει να είναι προαιρετικά

source: positional arguments
el_gr: ορίσματα θέσης

source: options
el_gr: επιλογές

source: show this help message and exit
el_gr: εμφάνιση αυτού του μηνύματος βοήθειας και έξοδος

source: cannot have multiple subparser arguments
el_gr: δεν μπορεί να έχει πολλαπλά ορίσματα subparser

source: unrecognized arguments: %s
el_gr: μη αναγνωρισμένα επιχειρήματα: %s

source: not allowed with argument %s
el_gr: δεν επιτρέπεται με το όρισμα %s

source: the following arguments are required: %s
el_gr: απαιτούνται τα ακόλουθα επιχειρήματα: %s

source: one of the arguments %s is required
el_gr: ένα από τα ορίσματα %s απαιτείται

source: expected one argument
el_gr: αναμενόταν ένα όρισμα

source: expected at most one argument
el_gr: το πολύ ένα επιχείρημα

source: expected at least one argument
el_gr: αναμενόταν τουλάχιστον ένα επιχείρημα

source: expected %s argument
el_gr: αναμενόμενο όρισμα %s

source: unexpected option string: %s
el_gr: συμβολοσειρά μη αναμενόμενης επιλογής: %s

source: %r is not callable
el_gr: %r δεν μπορεί να κληθεί

source: invalid %(type)s value: %(value)r
el_gr: μη έγκυρη τιμή %(type)s τιμή: %(value)r

source: invalid choice: %(value)r (choose from %(choices)s)
el_gr: μη έγκυρη επιλογή: %(value)r (επιλέξτε από το %(choices)s)

source: Could not initialize backend: %s
el_gr: Αδυναμία αρχικοποίησης του συστήματος υποστήριξης: %s

source: Backtrace of previous error: %s
el_gr: Backtrace του προηγούμενου σφάλματος: %s

source: Giving up after %s attempts. %s: %s
el_gr: Εγγραφή μετά από προσπάθειες %s . %s: %s

source: Attempt of %s Nr. %s failed. %s: %s
el_gr: Η προσπάθεια του %s Nr. %s απέτυχε. %s: %s

source: Reading results of '%s'
el_gr: Αποτελέσματα ανάγνωσης του '%s'

source: Writing %s
el_gr: Εγγραφή %s

source: File %s not found locally after get from backend
el_gr: Το αρχείο %s δεν βρέθηκε τοπικά μετά την λήψη από το σύστημα υποστήριξης

source: Connection failed, please check your password: %s
el_gr: Η σύνδεση απέτυχε, παρακαλώ ελέγξτε τον κωδικό πρόσβασής σας: %s

source: MultiBackend: Could not parse query string %s: %s
el_gr: MultiBackend: Δεν ήταν δυνατή η ανάλυση της συμβολοσειράς ερωτημάτων %s: %s

source: MultiBackend: Invalid query string %s: more than one value for %s
el_gr: MultiBackend: Μη έγκυρη συμβολοσειρά ερωτήματος %s: περισσότερες από μία τιμές για %s

source: MultiBackend: Invalid query string %s: unknown parameter %s
el_gr: MultiBackend: Μη έγκυρη συμβολοσειρά ερωτήματος %s: άγνωστη παράμετρος %s

source: MultiBackend: illegal value for %s: %s
el_gr: MultiBackend: παράνομη τιμή για %s: %s

source: MultiBackend: Could not load config file %s: %s
el_gr: MultiBackend: Δεν ήταν δυνατή η φόρτωση του αρχείου ρυθμίσεων %s: %s

source: MultiBackend: use store %s
el_gr: MultiBackend: χρήση καταστήματος %s

source: Multibackend: register affinity for prefix %s
el_gr: Multibackend: σύνδεση εγγραφής για το πρόθεμα %s

source: MultiBackend: failed to write to store #%s (%s), try #%s, Exception: %s
el_gr: MultiBackend: απέτυχε να γράψει για την αποθήκευση #%s (%s), δοκιμάστε #%s, Εξαίρεση: %s

source: MultiBackend: failed to write %s. Aborting process.
el_gr: MultiBackend: απέτυχε να γράψει %s. Εγκατάλειψη διαδικασίας.

source: MultiBackend: failed to write %s. Tried all backing stores and none succeeded
el_gr: MultiBackend: απέτυχε να γράψει %s. Δοκίμασε όλα τα καταστήματα υποστήριξης και κανένας δεν πέτυχε

source: MultiBackend: failed to get %s to %s from %s
el_gr: MultiBackend: απέτυχε να λάβει %s στο %s από %s

source: MultiBackend: failed to get %s. Tried all backing stores and none succeeded
el_gr: MultiBackend: απέτυχε να λάβει %s. Δοκίμασε όλα τα καταστήματα υποστήριξης και κανένας δεν πέτυχε

source: MultiBackend: %s: %d files
el_gr: MultiBackend: %s: %d αρχεία

source: MultiBackend: combined list: %s
el_gr: MultiBackend: συνδυασμένη λίστα: %s

source: MultiBackend: failed to delete %s. Tried all backing stores and none succeeded
el_gr: MultiBackend: απέτυχε να διαγραφεί το %s. Δοκίμασε όλα τα καταστήματα υποστήριξης και κανένας δεν πέτυχε

source: Attempt of initialize_oauth2_session Nr. %s failed. %s: %s
el_gr: Η προσπάθεια initialize_oauth2_session Nr. %s απέτυχε. %s: %s

source: PyDrive backend: multiple files called '%s'.
el_gr: PyDrive backend: πολλαπλά αρχεία που ονομάζονται '%s'.

source: Missing socket or ssl python modules.
el_gr: Λείπει η υποδοχή ή ssl python modules.

source: Cacert database file '%s' is not readable.
el_gr: Το αρχείο βάσης δεδομένων Cacert '%s' δεν είναι αναγνώσιμο.

source: Using WebDAV host %s port %s
el_gr: Χρησιμοποιώντας θύρα WebDAV host %s %s

source: WebDAV create connection on '%s'
el_gr: WebDAV δημιουργία σύνδεσης στο '%s'

source: WebDAV Unknown URI scheme: %s
el_gr: WebDAV Άγνωστο σχήμα URI: %s

source: WebDAV %s %s request with headers: %s
el_gr: WebDAV %s %s αίτημα με κεφαλίδες: %s

source: WebDAV data length: %s
el_gr: Μήκος δεδομένων WebDAV: %s

source: WebDAV redirect to: %s
el_gr: WebDAV ανακατευθύνεται σε: %s

source: WebDAV redirected 10 times. Giving up.
el_gr: WebDAV ανακατευθύνονται 10 φορές. Εγκατέλειψε.

source: WebDAV missing location header in redirect response.
el_gr: WebDAV λείπει κεφαλίδα τοποθεσίας σε απάντηση ανακατεύθυνσης.

source: WebDAV retry request with authentification headers.
el_gr: Αίτημα επανάληψης WebDAV με κεφαλίδες αυθεντικοποίησης.

source: WebDAV %s %s request2 with headers: %s
el_gr: WebDAV %s %s αίτημα2 με κεφαλίδες: %s

source: WebDAV response2 status %s with reason '%s'.
el_gr: WebDAV απόκριση2 κατάσταση %s με λόγο '%s'.

source: python-kerberos needed to use kerberos authorization, falling back to basic auth.
el_gr: python-kerberos χρειάζεται να χρησιμοποιήσετε kerberos εξουσιοδότηση, επιστρέφοντας στη βασική auth.

source: Kerberos authorization failed: %s. Falling back to basic auth.
el_gr: Η άδεια Kerberos απέτυχε: %s. Επιστροφή στη βασική ταυτοποίηση.

source: Creating missing directory %s
el_gr: Δημιουργία καταλόγου που λείπει %s

source: WebDAV MKCOL %s failed: %s %s
el_gr: Το WebDAV MKCOL %s απέτυχε: %s %s

source: WebDAV path decoding and translation: %s -> %s
el_gr: Αποκωδικοποίηση διαδρομής WebDAV και μετάφραση: %s -> %s

source: WebDAV GET Bad status code %s reason %s.
el_gr: WebDAV GET Κακός κωδικός κατάστασης %s λόγος %s.

source: WebDAV PUT Bad status code %s reason %s.
el_gr: WebDAV PUT Bad κωδικός κατάστασης %s λόγος %s.

source: path
el_gr: Διαδρομή

source: number
el_gr: αριθμός

source: seconds
el_gr: δευτερόλεπτα

source: shell_pattern
el_gr: μοτίβο_κελύφους

source: filename
el_gr: όνομα αρχείου

source: time
el_gr: ώρα

source: If set, an extra file with statistics in json format will be stored with each backup. It includes the statistics printed out on stdout by default. With 'collection-status' it returs these stats.
el_gr: Αν οριστεί, ένα επιπλέον αρχείο με στατιστικά σε μορφή json θα αποθηκευτεί με κάθε αντίγραφο ασφαλείας. Περιλαμβάνει τα στατιστικά στοιχεία που εκτυπώνονται στο stdout από προεπιλογή. Με την «κατάσταση συλλογής» επιστρέφει αυτά τα στατιστικά.

source: log_filename
el_gr: όνομα αρχείου καταγραφής

source: backup name
el_gr: όνομα αντιγράφου ασφαλείας

source: s3_kms_grant
el_gr: s3_kms_επιχορήγηση

source: s3_region_name
el_gr: s3_περιοχή_όνομα

source: policy
el_gr: πολιτική

source: command
el_gr: εντολή

source: pem formatted bundle of certificate authorities
el_gr: δέσμη των αρχών έκδοσης πιστοποιητικών με μορφότυπο pem

source: path to a folder with certificate authority files
el_gr: διαδρομή προς ένα φάκελο με αρχεία αρχής πιστοποίησης

source: char
el_gr: χαρακτήρας

source: verb
el_gr: ρήμα

source: extra headers for Webdav, like 'Cookie,name=value'
el_gr: επιπλέον κεφαλίδες για το Webdav, όπως 'Cookie,name=value'

source: absolute_path
el_gr: απόλυτη_διαδρομή

source: bucket_name
el_gr: όνομα bucket_name

source: container_name
el_gr: όνομα_εμπορευματοκιβωτίου

source: count
el_gr: υπολογισμός

source: directory
el_gr: κατάλογος

source: module
el_gr: ενότητα

source: password
el_gr: κωδικός πρόσβασης

source: port
el_gr: θύρα

source: prefix
el_gr: πρόθεμα

source: relative_path
el_gr: σχετική_διαδρομή

source: some_dir
el_gr: κάποιος_dir

source: source_path
el_gr: διαδρομή_πηγής

source: user
el_gr: χρήστης

source: account_id
el_gr: id

source: application_key
el_gr: κλειδί_εφαρμογή

source: remote
el_gr: απομακρυσμένο

source: Backends and their URL formats:
el_gr: Υποστηρικτικά και τις μορφές URL τους:

source: No valid action found. Will imply 'backup' because a path source was given and target is a url location.
el_gr: Δεν βρέθηκε καμία έγκυρη ενέργεια. Θα σημαίνει 'αντίγραφο ασφαλείας' επειδή δόθηκε μια πηγή διαδρομής και ο στόχος είναι μια τοποθεσία url.

source: No valid action found. Will imply 'restore' because url source was given and target is a local path.
el_gr: Δεν βρέθηκε καμία έγκυρη ενέργεια. Θα υπονοεί 'επαναφορά' επειδή δόθηκε η πηγή url και ο στόχος είναι μια τοπική διαδρομή.

source: Enter 'duplicity --help' for help screen.
el_gr: Πληκτρολογήστε το 'duplicity --help' για την οθόνη βοήθειας.

source: Running in 'ignore errors' mode due to --ignore-errors. Please reconsider if this was not intended
el_gr: Εκτέλεση σε λειτουργία 'αγνόησε σφάλματα' λόγω -- αγνοήσεων-σφαλμάτων. Παρακαλώ επανεξετάστε αν αυτό δεν προοριζόταν

source: Error %s getting delta for %s
el_gr: Σφάλμα %s να πάρει το δέλτα για %s

source: Getting delta of %s and %s
el_gr: Λήψη δέλτα του %s και %s

source: M %s
el_gr: Μ %s

source: Comparing %s and %s
el_gr: Σύγκριση %s και %s

source: BackupSet.delete: missing %s
el_gr: BackupSet.delete: λείπει %s

source: Fatal Error: No manifests found for most recent backup
el_gr: Ανεπανόρθωτο σφάλμα: Δεν βρέθηκαν εκδηλώσεις για τα πιο πρόσφατα αντίγραφα ασφαλείας

source: Fatal Error: Remote manifest does not match local one. Either the remote backup set or the local archive directory has been corrupted.
el_gr: Μοιραίο σφάλμα: Η απομακρυσμένη διακήρυξη δεν ταιριάζει με την τοπική. Είτε το απομακρυσμένο αντίγραφο ασφαλείας είτε ο τοπικός φάκελος αρχειοθήκης έχει καταστραφεί.

source: Error processing remote manifest (%s): %s
el_gr: Σφάλμα επεξεργασίας απομακρυσμένου δηλωτικού (%s): %s

source: Fatal Error: Neither remote nor local manifest is readable.
el_gr: Ανεπανόρθωτο σφάλμα: Ούτε το απομακρυσμένο ούτε το τοπικό δηλωτικό δεν είναι αναγνώσιμο.

source: Processing local manifest %s (%s)
el_gr: Επεξεργασία τοπικού δηλωτικού %s (%s)

source: Preferring Backupset over previous one!
el_gr: Προτιμώντας Backupset σε σχέση με το προηγούμενο!

source: Ignoring incremental Backupset (start_time: %s; needed: %s)
el_gr: Αγνόηση στοιχειώδους αντιγράφου ασφαλείας (start_time: %s; απαιτείται: %s)

source: Added incremental Backupset (start_time: %s / end_time: %s)
el_gr: Προστέθηκε οριακό Αντίγραφο Ασφαλείας (έναρξη_ώρα: %s / end_time: %s)

source: Chain start time:
el_gr: Ώρα έναρξης αλυσίδας:

source: Chain end time:
el_gr: Ώρα λήξης αλυσίδας:

source: Number of contained backup sets: %d
el_gr: Αριθμός περιεχόμενων συνόλων αντιγράφων ασφαλείας: %d

source: Total number of contained volumes: %d
el_gr: Συνολικός αριθμός περιορισμένων όγκων: %d

source: Type of backup set:
el_gr: Είδος αντιγράφου ασφαλείας:

source: Time:
el_gr: Ώρα:

source: Num volumes:
el_gr: Αριθμός όγκων:

source: Full
el_gr: Πλήρες

source: Incremental
el_gr: Βηματικό

source: local
el_gr: τοπικό

source: Collection Status
el_gr: Κατάσταση Συλλογής

source: Connecting with backend: %s
el_gr: Σύνδεση με σύστημα υποστήριξης: %s

source: Archive dir: %s
el_gr: Συρραφή αρχειοθέτησης: %s

source: Found %d secondary backup chain(s).
el_gr: Βρέθηκαν %d δευτερεύουσες αλυσίδες αντιγράφων ασφαλείας.

source: Secondary chain %d of %d:
el_gr: Δευτερεύουσα αλυσίδα %d %d:

source: Found primary backup chain with matching signature chain:
el_gr: Βρέθηκε η κύρια αλυσίδα αντιγράφων ασφαλείας με την αντίστοιχη αλυσίδα υπογραφών:

source: No backup chains with active signatures found
el_gr: Δεν βρέθηκαν εφεδρικές αλυσίδες με ενεργές υπογραφές

source: Also found %d backup set(s) not part of any chain,
el_gr: Βρέθηκαν επίσης %d τα σύνολα αντιγράφων ασφαλείας δεν αποτελούν μέρος οποιασδήποτε αλυσίδας,

source: and %d incomplete backup set(s).
el_gr: και %d ελλιπές σετ αντιγράφων ασφαλείας.

source: These may be deleted by running duplicity with the "cleanup" command.
el_gr: Αυτά μπορεί να διαγραφούν εκτελώντας διπλή εντολή με την εντολή "εκκαθάρισης".

source: No orphaned or incomplete backup sets found.
el_gr: Δεν βρέθηκαν ορφανά ή ελλιπή σύνολα αντιγράφων ασφαλείας.

source: %d file(s) exists on backend
el_gr: %d αρχείο(α) υπάρχει στο σύστημα υποστήριξης

source: Warning, discarding last backup set, because of missing signature file.
el_gr: Προειδοποίηση, απόρριψη του τελευταίου αντιγράφου ασφαλείας, λόγω του ελλείποντος αρχείου υπογραφής.

source: Warning, found the following local orphaned signature file(s):
el_gr: Προειδοποίηση, βρέθηκαν τα ακόλουθα τοπικά ορφανά αρχεία υπογραφής:

source: Warning, found the following remote orphaned signature file(s):
el_gr: Προειδοποίηση, βρέθηκαν τα ακόλουθα απομακρυσμένα ορφανά αρχεία υπογραφής:

source: Warning, found signatures but no corresponding backup files
el_gr: Προειδοποίηση, βρέθηκαν υπογραφές αλλά δεν υπάρχουν αντίστοιχα αρχεία αντιγράφων ασφαλείας

source: Warning, found incomplete backup sets, probably left from aborted session
el_gr: Προειδοποίηση, βρέθηκε ελλιπής δημιουργία αντιγράφων ασφαλείας, πιθανώς απέμεινε από την ακυρωμένη συνεδρία

source: Warning, found the following orphaned backup file(s):
el_gr: Προειδοποίηση, βρέθηκαν τα ακόλουθα ορφανά αρχεία αντιγράφων ασφαλείας:

source: Extracting backup chains from list of files: %s
el_gr: Εξαγωγή αλυσίδων αντιγράφων ασφαλείας από λίστα αρχείων: %s

source: File %s is part of known set
el_gr: Το αρχείο %s είναι μέρος του γνωστού σετ

source: File %s is not part of a known set; creating new set
el_gr: Το αρχείο %s δεν αποτελεί μέρος ενός γνωστού σετ, δημιουργώντας νέο σετ

source: Ignoring file (rejected by backup set) '%s'
el_gr: Αγνόηση αρχείου (απορρίφθηκε από το σύνολο αντιγράφων ασφαλείας) '%s'

source: Found backup chain %s
el_gr: Βρέθηκε αλυσίδα αντιγράφων ασφαλείας %s

source: Added set %s to pre-existing chain %s
el_gr: Προστέθηκε %s σε προϋπάρχουσα αλυσίδα %s

source: Found orphaned set %s
el_gr: Βρέθηκε ορφανά σετ %s

source: No signature chain for the requested time. Using oldest available chain, starting at time %s.
el_gr: Δεν υπάρχει αλυσίδα υπογραφής για το χρόνο που ζητήθηκε. Χρησιμοποιώντας την παλαιότερη διαθέσιμη αλυσίδα, ξεκινώντας από τη στιγμή %s.

source: File: %s
el_gr: Αρχείο: %s

source: Total number of backup: %d
el_gr: Συνολικός αριθμός αντιγράφων ασφαλείας: %d

source: Type of file change:
el_gr: Τύπος αλλαγής αρχείου:

source: Backup set time: %s
el_gr: Ώρα δημιουργίας αντιγράφων ασφαλείας: %s

source: Total number of changes: %d
el_gr: Συνολικός αριθμός αλλαγών: %d

source: File:
el_gr: Αρχείο:

source: Reuse configured PASSPHRASE as SIGN_PASSPHRASE
el_gr: Επαναχρησιμοποίηση ρυθμισμένου PASSPHRASE ως SIGN_PASSPHRASE

source: Reuse configured SIGN_PASSPHRASE as PASSPHRASE
el_gr: Επαναχρησιμοποίηση του ρυθμισμένου SIGN_PASSPHRASE ως PASSPHRASE

source: PASSPHRASE variable not set, asking user.
el_gr: Η μεταβλητή PASSPHRASE δεν έχει οριστεί, ζητώντας από το χρήστη.

source: Retype passphrase for signing key to confirm:
el_gr: Πληκτρολογήστε ξανά τη φράση πρόσβασης για την υπογραφή του κλειδιού για επιβεβαίωση:

source: Retype passphrase for decryption to confirm:
el_gr: Πληκτρολογήστε ξανά τη φράση πρόσβασης για την αποκρυπτογράφηση για επιβεβαίωση:

source: First and second passphrases do not match! Please try again.
el_gr: Οι φράσεις πρώτου και δεύτερου κωδικού δεν ταιριάζουν! Παρακαλώ προσπαθήστε ξανά.

source: Cannot use empty passphrase with symmetric encryption! Please try again.
el_gr: Αδυναμία χρήσης κενής φράσης πρόσβασης με συμμετρική κρυπτογράφηση! Παρακαλώ δοκιμάστε ξανά.

source: File %s complete in backup set. Continuing restart on file %s.
el_gr: Το αρχείο %s ολοκληρώθηκε στο εφεδρικό σετ. Συνεχίζοντας την επανεκκίνηση στο αρχείο %s.

source: File %s missing in backup set. Continuing restart on file %s.
el_gr: Το αρχείο %s λείπει από το αντίγραφο ασφαλείας. Συνεχίζοντας την επανεκκίνηση στο αρχείο %s.

source: File %s was corrupted during upload.
el_gr: Το %s ήταν κατεστραμμένο κατά τη μεταφορά.

source: Restarting backup, but current encryption settings do not match original settings
el_gr: Επανεκκίνηση αντιγράφων ασφαλείας, αλλά οι τρέχουσες ρυθμίσεις κρυπτογράφησης δεν ταιριάζουν με τις αρχικές ρυθμίσεις

source: Processed volume %d
el_gr: Επεξεργασμένος όγκος %d

source: Skipping encryption validation due to glacier/deep storage
el_gr: Παράλειψη επικύρωσης κρυπτογράφησης λόγω παγετώνας/βαθιάς αποθήκευσης

source: Restarting after volume %s, file %s, block %s
el_gr: Επανεκκίνηση μετά την ένταση %s, αρχείο %s, μπλοκ %s

source: Skipped volume upload, as effectivly nothing has changed
el_gr: Παράκαμψη φόρτισης τόμου, καθώς ουσιαστικά τίποτα δεν έχει αλλάξει

source: Fatal Error: Unable to start incremental backup. Old signatures not found and incremental specified
el_gr: Ανεπανόρθωτο σφάλμα: Αδυναμία εκκίνησης στοιχειώδους αντιγράφου ασφαλείας. Δεν βρέθηκαν παλιές υπογραφές και καθορισμένες στοιχειώδεις

source: No signatures found, switching to full backup.
el_gr: Δεν βρέθηκαν υπογραφές, μετάβαση σε πλήρη αντίγραφα ασφαλείας.

source: Backup Statistics
el_gr: Στατιστικά αντιγράφων ασφαλείας

source: %s not found in archive - no files restored.
el_gr: Το %s δεν βρέθηκε στην αρχειοθήκη - δεν έγινε επαναφορά αρχείων.

source: No files found in archive - nothing restored.
el_gr: Δεν βρέθηκαν αρχεία στην αρχειοθήκη - τίποτα δεν αποκαταστάθηκε.

source: Processed volume %d of %d
el_gr: Επεξεργασμένος όγκος %d %d

source: Invalid data - %s hash mismatch for file:
el_gr: Μη έγκυρα δεδομένα - Ασυμφωνία %s hash για το αρχείο:

source: Calculated hash: %s
el_gr: Υπολογισμένο hash: %s

source: Manifest hash: %s
el_gr: Κατακερματισμός εκδήλωσης: %s

source: IGNORED_ERROR: Warning: ignoring error as requested: %s: %s
el_gr: IGNORED_ERROR: Προειδοποίηση: αγνοώντας το σφάλμα όπως ζητήθηκε: %s: %s

source: Volume was signed by key %s, not %s
el_gr: Ο τόμος υπογράφηκε από το κλειδί %s, όχι %s

source: Verify complete: %s, %s.
el_gr: Η επαλήθευση ολοκληρώθηκε: %s, %s.

source: %d difference(s) found
el_gr: %d βρέθηκε διαφορά(ες)

source: No extraneous files found, nothing deleted in cleanup.
el_gr: Δεν βρέθηκαν εξωγενή αρχεία, τίποτα δεν διαγράφηκε κατά τον καθαρισμό.

source: Found the following file(s) to delete:
el_gr: Βρέθηκαν τα παρακάτω αρχεία για διαγραφή:

source: Run duplicity again with the --force option to actually delete.
el_gr: Εκτελέστε ξανά διπλότυπη λειτουργία με την επιλογή --force για να διαγράψετε πραγματικά.

source: There are backup set(s) at time(s):
el_gr: Υπάρχουν σύνολο(α) αντιγράφων ασφαλείας την (τις) ώρα(-ες):

source: Which can't be deleted because newer sets depend on them.
el_gr: Ποια δεν μπορεί να διαγραφεί, επειδή τα νεότερα σετ εξαρτώνται από αυτά.

source: Current active backup chain is older than specified time. However, it will not be deleted. To remove all your backups, manually purge the repository.
el_gr: Η τρέχουσα ενεργή αλυσίδα αντιγράφων ασφαλείας είναι παλαιότερη από την καθορισμένη ώρα. Ωστόσο, δεν θα διαγραφεί. Για να καταργήσετε όλα τα αντίγραφα ασφαλείας, καθαρίστε χειροκίνητα το αποθετήριο.

source: No old backup sets found, nothing deleted.
el_gr: Δεν βρέθηκαν παλιά σύνολα αντιγράφων ασφαλείας, τίποτα δεν διαγράφηκε.

source: Deleting backup chain(s) at time:
el_gr: Διαγραφή αλυσίδας(ών) αντιγράφων ασφαλείας ταυτόχρονα:

source: Deleting any incremental signature chain rooted at %s
el_gr: Διαγραφή κάθε στοιχειώδους αλυσίδας υπογραφής ριζωμένη στο %s

source: Deleting any incremental backup chain rooted at %s
el_gr: Διαγραφή κάθε αυξητικής αλυσίδας αντιγράφων ασφαλείας ριζωμένη στο %s

source: Deleting complete signature chain %s
el_gr: Διαγραφή πλήρους αλυσίδας υπογραφής %s

source: Deleting complete backup chain %s
el_gr: Διαγραφή πλήρους αντιγράφου ασφαλείας αλυσίδας %s

source: Found old backup chain(s) at the following time:
el_gr: Βρέθηκαν παλιές εφεδρικές αλυσίδες την ακόλουθη στιγμή:

source: Rerun command with --force option to actually delete.
el_gr: Rerun εντολή με την επιλογή --force να διαγραφεί πραγματικά.

source: Deleting local %s (not authoritative at backend).
el_gr: Διαγραφή τοπικών %s (όχι έγκυρων στο σύστημα υποστήριξης).

source: Unable to delete %s: %s
el_gr: Αδυναμία διαγραφής %s: %s

source: Failed to read %s: %s
el_gr: Αποτυχία ανάγνωσης %s: %s

source: Copying %s to local cache.
el_gr: Αντιγραφή %s στην τοπική προσωρινή μνήμη.

source: Local and Remote metadata are synchronized, no sync needed.
el_gr: Τα τοπικά και απομακρυσμένα μεταδεδομένα συγχρονίζονται, δεν απαιτείται συγχρονισμός.

source: Synchronizing remote metadata to local cache...
el_gr: Συγχρονισμός απομακρυσμένων μεταδεδομένων στην τοπική μνήμη...

source: Sync would copy the following from remote to local:
el_gr: Ο συγχρονισμός θα αντιγράψει τα ακόλουθα από απομακρυσμένο σε τοπικό:

source: Sync would remove the following spurious local files:
el_gr: Συγχρονισμός θα καταργήσει τα ακόλουθα παρασιτικά τοπικά αρχεία:

source: Unable to get free space on temp.
el_gr: Δεν είναι δυνατή η λήψη ελεύθερου χώρου στον temp.

source: Unable to get max open files.
el_gr: Δεν είναι δυνατή η λήψη μέγιστου ανοίγματος αρχείων.

source: RESTART: The first volume failed to upload before termination. Restart is impossible...starting backup from beginning.
el_gr: RESTART: Ο πρώτος τόμος απέτυχε να φορτώσει πριν το τερματισμό. Η επανεκκίνηση είναι αδύνατη... ξεκινώντας από την αρχή.

source: RESTART: Volumes %d to %d failed to upload before termination. Restarting backup at volume %d.
el_gr: RESTART: Οι τόμοι %d στο %d απέτυχαν να μεταφορτώσουν πριν το τερματισμό. Επανεκκίνηση αντιγράφων ασφαλείας στο %d.

source: Last full backup date: none
el_gr: Τελευταία ημερομηνία πλήρους αντιγράφου ασφαλείας: κανένα
