Repository: pypi-data/pypi-mirror-376
Catalog: packages/duplicity/duplicity-3.0.6.dev8.tar.gz/duplicity-3.0.6.dev8/po/*.po
Languages: el_gr

source: Last full backup is too old, forcing full backup
el_gr: Το τελευταίο πλήρες αντίγραφο ασφαλείας είναι πολύ παλιό, αναγκάζοντας πλήρη αντίγραφα ασφαλείας

source: When using symmetric encryption, the signing passphrase must equal the encryption passphrase.
el_gr: Όταν χρησιμοποιείτε συμμετρική κρυπτογράφηση, η φράση πρόσβασης υπογραφής πρέπει να ισούται με τη φράση πρόσβασης κρυπτογράφησης.

source: Bad interval string "%s" Intervals are specified like 2Y (2 years) or 2h30m (2.5 hours). The allowed special characters are s, m, h, D, W, M, and Y. See the man page for more information.
el_gr: Εσφαλμένη συμβολοσειρά διαστήματος "%s" Τα διαστήματα ορίζονται ως 2Y (2 χρόνια) ή 2h30m (2,5 ώρες). Το επιτρέπει ειδικούς χαρακτήρες είναι s, m, h, D, W, M και Y. Δείτε τη σελίδα του ανθρώπου για περισσότερες πληροφορίες.

source: Bad time string "%s" The acceptible time strings are intervals (like "3D64s"), w3-datetime strings, like "2002-04-26T04:22:01-07:00" (strings like "2002-04-26T04:22:01" are also acceptable - duplicity will use the current time zone), or ordinary dates like 2/4/1997 or 2001-04-23 (various combinations are acceptable, but the month always precedes the day).
el_gr: Bad time string "%s" Οι αποδεκτές χρονικές συμβολοσειρές είναι διαστήματα (όπως "3D64s"), w3-datetime strings, όπως "2002-04-26T04:22:01-07:00" (συμβολοσειρές όπως "2002-04-26T04:22:01" είναι επίσης αποδεκτές - η διπλότητα θα χρησιμοποιήσει την τρέχουσα ζώνη ώρας ), ή συνηθισμένες ημερομηνίες όπως 2/4/1997 ή 2001-04-23 (διάφοροι συνδυασμοί είναι αποδεκτοί, αλλά ο μήνας προηγείται πάντα την ημέρα).

source: Warning: oldindex %s >= newindex %s
el_gr: Προειδοποίηση: oldindex %s >= newindex %s

source: Error '%s' processing %s
el_gr: Σφάλμα '%s' επεξεργασίας %s

source: Skipping %s because of previous error
el_gr: Παράλειψη %s λόγω προηγούμενου σφάλματος

source: basis_file must be a (true) file or an object whose file attribute is the underlying true file object
el_gr: basis_file πρέπει να είναι ένα (true) αρχείο ή ένα αντικείμενο του οποίου το χαρακτηριστικό αρχείου είναι το υποκείμενο πραγματικό αντικείμενο αρχείου

source: Fatal Error: Backup source host has changed. Current hostname: %s Previous hostname: %s
el_gr: Μοιραίο σφάλμα: Ο κεντρικός υπολογιστής αντιγράφου ασφαλείας έχει αλλάξει. Τρέχον όνομα κεντρικού υπολογιστή: %s Προηγούμενο όνομα: %s

source: Fatal Error: Backup source directory has changed.
el_gr: Ανεπανόρθωτο σφάλμα: Ο εφεδρικός κατάλογος πηγαίου κώδικα έχει αλλάξει.

source: Aborting because you may have accidentally tried to backup two different data sets to the same remote location, or using the same archive directory. If this is not a mistake, use the --allow-source-mismatch switch to avoid seeing this message
el_gr: Εγκατάλειψη επειδή μπορεί να προσπαθήσατε τυχαία να δημιουργήσετε αντίγραφα ασφαλείας δύο διαφορετικών συνόλων δεδομένων στην ίδια απομακρυσμένη τοποθεσία, ή χρησιμοποιώντας τον ίδιο κατάλογο αρχειοθήκης. Εάν αυτό δεν είναι λάθος, χρησιμοποιήστε την αλλαγή -- allow-source-mismatch για να αποφύγετε να δείτε αυτό το μήνυμα

source: Found manifest volume %s
el_gr: Βρέθηκε τόμος δηλώσεων %s

source: Found %s volumes in manifest
el_gr: Βρέθηκαν τόμοι %s στο δηλωτικό

source: Manifests not equal because different volume numbers
el_gr: Εκδηλώσεις δεν είναι ίσες, επειδή διαφορετικοί αριθμοί όγκου

source: Manifests not equal because volume lists differ
el_gr: Οι εκδηλώσεις δεν είναι ίσες επειδή οι λίστες τόμων διαφέρουν

source: Manifests not equal because hosts or directories differ
el_gr: Οι γνωστοποιήσεις δεν είναι ίσες, επειδή οι υπολογιστές ή οι κατάλογοι διαφέρουν

source: Warning, found extra Volume identifier
el_gr: Προειδοποίηση, βρέθηκε πρόσθετο αναγνωριστικό τόμου

source: Other is not VolumeInfo
el_gr: Άλλες δεν είναι VolumeInfo

source: Volume numbers don't match
el_gr: Οι αριθμοί έντασης δεν ταιριάζουν

source: start_indicies don't match
el_gr: οι δείκτες_start_indicies δεν ταιριάζουν

source: end_index don't match
el_gr: end_index δεν ταιριάζουν

source: Hashes don't match
el_gr: Τα Hashes δεν ταιριάζουν

source: Patching %s
el_gr: Ενσωμάτωση %s

source: Error '%s' patching %s
el_gr: Σφάλμα '%s' patching %s

source: Writing %s of type %s
el_gr: Εγγραφή %s τύπου %s

source: Warning: %s invalid devnums (0x%X), treating as (0, 0).
el_gr: Προειδοποίηση: %s μη έγκυροι devnums (0x%X), αντιμετωπίζοντας ως (0, 0).

source: Warning: %s has negative mtime, treating as 0.
el_gr: Προειδοποίηση: %s έχει αρνητικό χρόνο, αντιμετωπίζοντας ως 0.

source: New file %s
el_gr: Νέο αρχείο %s

source: File %s is missing
el_gr: Λείπει το αρχείο %s

source: File %%s has type %s, expected %s
el_gr: Το αρχείο %%s έχει τύπο %s, αναμένεται %s

source: File %%s has permissions %s, expected %s
el_gr: Το αρχείο %%s έχει δικαιώματα %s, αναμένεται %s

source: File %%s has mtime %s, expected %s
el_gr: Το αρχείο %%s έχει mtime %s, αναμένεται %s

source: Data for file %s is different
el_gr: Τα δεδομένα για το αρχείο %s είναι διαφορετικά

source: Device file %%s has numbers %s, expected %s
el_gr: Το αρχείο συσκευής %%s έχει αριθμούς %s, αναμένεται %s

source: Making directory %s
el_gr: Δημιουργία καταλόγου %s

source: Deleting %s
el_gr: Διαγραφή %s

source: Touching %s
el_gr: Αγγίξτε %s

source: Deleting tree %s
el_gr: Διαγραφή δέντρου %s

source: Error listing directory %s
el_gr: Σφάλμα στην καταχώρηση καταλόγου %s

source: Skipping socket %s
el_gr: Παράλειψη υποδοχής %s

source: Error initializing file %s
el_gr: Σφάλμα αρχικοποίησης αρχείου %s

source: Error accessing possibly locked file %s
el_gr: Σφάλμα πρόσβασης πιθανώς κλειδωμένου αρχείου %s

source: Warning: base %s doesn't exist, continuing
el_gr: Προειδοποίηση: η βάση %s δεν υπάρχει, συνεχίζοντας

source: Selecting %s
el_gr: Επιλογή %s

source: Fatal Error: The file specification %s cannot match any files in the base directory %s Useful file specifications begin with the base directory or some pattern (such as '**') which matches the base directory.
el_gr: Ανεπανόρθωτο σφάλμα: Η προδιαγραφή αρχείου %s δεν μπορεί να ταιριάζει με κανένα αρχείο στον βασικό κατάλογο %s Χρήσιμες προδιαγραφές αρχείων αρχίζουν με τον βασικό κατάλογο ή κάποιο μοτίβο (όπως το '**') που ταιριάζει με το βασικό κατάλογο.

source: Fatal Error while processing expression %s
el_gr: Ανεπανόρθωτο σφάλμα κατά την επεξεργασία της έκφρασης %s

source: Reading files to backup from list %s
el_gr: Ανάγνωση αρχείων σε αντίγραφα ασφαλείας από τη λίστα %s

source: Files-from list contains the absolute path: %s All paths specified in a files-from list must be given relative to the backup source path.
el_gr: Τα αρχεία-από τη λίστα περιέχουν την απόλυτη διαδρομή: %s Όλες οι διαδρομές που καθορίζονται σε μια λίστα αρχείων πρέπει να δοθούν σε σχέση με το αντίγραφο ασφαλείας της πηγαίας διαδρομής.

source: Reading %s filelist %s
el_gr: Ανάγνωση %s filelist %s

source: Error compiling regular expression %s
el_gr: Σφάλμα κατά τη μεταγλώττιση κανονικής έκφρασης %s

source: Using temporary directory %s
el_gr: Χρήση προσωρινού καταλόγου %s

source: Registering (mktemp) temporary file %s
el_gr: Εγγραφή (mktemp) προσωρινού αρχείου %s

source: Registering (mkstemp) temporary file %s
el_gr: Εγγραφή (mkstemp) προσωρινού αρχείου %s

source: Forgetting temporary file %s
el_gr: Σφυρηλάτηση προσωρινού αρχείου %s

source: Attempt to forget unknown tempfile %s - this is probably a bug.
el_gr: Προσπάθεια να ξεχάσετε άγνωστο tempfile %s - αυτό είναι πιθανώς ένα σφάλμα.

source: Acquiring lockfile %s
el_gr: Απόκτηση αρχείου κλειδώματος %s

source: Releasing lockfile %s
el_gr: Απελευθέρωση αρχείου κλειδώματος %s
