# akioi (oi-2048) 游戏指北

## 界面介绍

![游戏界面截图](all.png)

1. **分数**
   1. **分数**，显示当前游戏的得分
   2. **纪录**，显示你在本机上的，不作弊的最高分
2. **控制按钮**，按照文本阅读顺序分别是`重新开始`，`获得提示`以及`作弊调节按钮`。
3. **游戏区域**，由4×4的网格构成，网格中可以有方块，是主体部分，其上有时会显示叠加层。
4. **数值提示**，给出了方块颜色、名称与数值之间的对应关系。
   1. 在移动界面上，数值提示是隐藏的。
   2. 在iPad界面上，数值提示显示在游戏区域右侧，但只显示有标签的色块，不显示方块全名
   3. 在PC界面上，数值提示完整显示
5. **排行榜**，显示用户主动提交的成绩排名。

## 方块

游戏中一共有19种方块，每种方块都对应了实际数值。

![方块键值对应表](blocks.png)

如图，线上的方块只在数值相同时会合并（数值方块），线下的可以和线上的随意合并。

## 分数

分数用于评估一局游戏的总体情况，同时是排行榜排名的依据。

方块合并时会获得分数。

## 合并

当两个方块“碰撞”到一起时，会发生合并。

- 数值方块和数值方块合并，仅在数值相同时会发生，合并时数值相加，得分为合并的两数值之和。
  - 如：**[512]** + **[512]** = **[1024]**，得分**1024**
  - 两个数值为**65536**的方块不可以合并。
- 倍增方块和倍增方块合并，仅在类型相同时发生，合并时乘号后的数值相加，扣除分数为合并后的方块乘号后的数值。
  - 如：**[×2]** + **[×2]** = **[×4]**，扣除分数**4**
  - 两个 **[×4]** 方块不可再合并
- 倍增方块与数值方块合并，任何情况下皆可发生，合并后为一个数值方块，数值为原有数值方块的值乘上原有倍增方块乘号后的值，得分为合并后方块的数值。
  - 如：**[512]** + **[×2]** = **[1024]**，得分**1024**

## 移动

移动是用户玩游戏的基本操作。

在游戏界面静止，且游戏既没有通关也没有失败时，用户可以选择向上下左右四个方向移动方块。操作方式为按键盘方向键或用手指划屏。

操作后，方块会向指定方向倾倒，并且可能发生合并。

## 合并法则

此处以向下移动为例。参考下面的局面。

```plain
2     4     8     1024
      4     512   ×2
2     4     ×1    64
2     4     ×1    64
```

规则：

1. 每列单独处理
2. 对于每一列，从下向上扫描两个中间没有任何方块的方块。
   1. 如果两个方块完全相同且可合并，移除两个方块，将其合并成一个新的方块，并放在原来位置较低的方块处。接下来从这个新方块的上面开始扫描，而不再扫描新方块。
   2. 如果一个数值和一个倍增方块可合并，那么要满足 ①两个方块原来相邻 ②位置较低的方块下面，直到游戏区域底部，都没有空白的格子 它们才能合并（合并的处理方式和两个完全相同的方块一样），否则不会合并。
3. 最后，将所有方块按重力掉落到最下面。

我们对上面局面的4列同时处理。

```plain
2     4     8     1024
      4     512   ×2
[2]   [4]   [×1]  [64]
[2]   [4]   [×1]  [64]
```

▲ 第一次扫描

```plain
2     [4]   [8]   [1024]
      [4]   [512] [×2]

4     8     ×2    128
```

▲ 合并后，不再扫描新生成的方块。图中 **[1024]**和**[×2]** 不可合并，因为 **[×2]** 下面有空格。

```plain
2           8     1024
      8     512   ×2  

4     8     ×2    128
```

▲ 扫描结束后的样子

```plain

            8     1024
2     8     512   ×2
4     8     ×2    128
```

▲ 最终局面

如果经过计算，发现移动操作完成后局面和移动前完全相同，系统将忽略这次移动操作。

## 游戏结束

**通关**：制造出了一个 **[65536]** 方块，判定通关。游戏界面会显示`You AK IOI!`

**结束**：当前局面下，无论如何进行移动操作，都会被系统忽略，系统会自动结束游戏，显示`AFO`

在游戏通关或结束后，可以选择将自己的成绩提交到排行榜。

## 生成新方块

生成新方块是系统自动的行为。系统会在空白格子中随机选择一个，并随机生成以下方块之一：

- **[2]**，概率0.783
- **[4]**，概率0.078
- **[×1]**，概率0.1118
- **[×2]**，概率0.0182

在游戏开局时，系统会生成2个新方块。

如果移动操作没有被忽略，系统在操作后会生成1个新方块。

## 排行榜

用户可以在游戏结束后提交成绩到排行榜。用户需要设定一个长度在2和14之间的英文字母、数字和下划线名字，并且 30 天内不可修改。

排行榜仅保留最近 45 天的记录。

其中，斜体字“电脑”是作弊功能中“自动模式”所获得的成绩，可以参考或超越。

排行榜的排序规则（从上到下实行）：

- 如果分数不同，将分数高的排在前面
- 如果最大值（游戏结束时数值最大的方块）不同，将最大值高的排在前面。
- 将提交时间早的排在前面。

## 提示

始终将最大值保持在一个角上，并试图将次大的值围在其周围。

尝试维护最大值所在行或列的单调性，并使其~~方差~~差异尽可能小。

## 鸣谢

项目原作者：[Gabriele Cirulli](http://gabrielecirulli.com)

基于：[1024 by Veewo Studio](https://itunes.apple.com/us/app/1024!/id823499224)

AI程序作者：[Matt Overlan](https://github.com/ov3y/2048-AI)

魔改&排行榜：[yezhiyi9670](https://ak-ioi.com/)

---

[此页面的源文件](source.php)
