Repository: pypi-data/pypi-mirror-376
Catalog: packages/music_sampler/music_sampler-1.7.0.tar.gz/music_sampler-1.7.0/music_sampler/locales/*/LC_MESSAGES/music_sampler.po
Languages: fr

source: unknown action {}
fr: Action « {} » inconnue

source: A Music Sampler application.
fr: Un lecteur de musique préprogrammable

source: Config file to load
fr: Fichier de configuration à charger

source: Folder in which to find the music files
fr: Dossier dans lequel trouver les fichiers de musiques

source: Print messages in console
fr: Afficher les messages de debug

source: Make the mixing of sounds manually (do it if the system cannot handle it correctly)
fr: Faire le mixage en interne (activer si le système n'y parvient pas)

source: Latency: low, high or number of seconds
fr: Latence: low, high ou un nombre de secondes.

source: Blocksize: If not 0, the number of frames to take at each step for the mixer
fr: Taille de block: si non nul, indique le nombre de frames à prendre à chaque étape de mixage

source: Frame rate to play the musics
fr: Fréquence d'échantillonnage pour jouer les musiques

source: Number of channels to use
fr: Nombre de canaux par musique

source: Sample width (number of bytes for each frame)
fr: Largeur d'échantillonnage (nombre d'octets pour chaque frame)

source: Displays the current version and exits. Only use in bundled package
fr: Affiche la version courante et quitte (utilisable uniuqement pour la version compilée)

source: Select this sound device
fr: Sélectionne le périphérique de son

source: List available sound devices
fr: Affiche la liste des périphériques de son disponibles

source: Don't show warning when focus is lost
fr: Ne pas afficher d'avertissement lorsque l'application perd le focus.

source: Select another language
fr: Choix d'une autre langue

source: Kivy arguments. All arguments after this are interpreted by Kivy. Pass "-- --help" to get Kivy's usage.
fr: Arguments à passer à la librairie Kivy

source: option '-v' can only be used in bundled package
fr: L'argument '-V' ne peut être utilisé que dans la version compilée

source: interrupt wait with id {}
fr: Interrompre l'attente d'identifiant {}

source: interrupt all waits
fr: Interrompre toutes les attentes

source: pausing « {} »
fr: mise en pause de « {} »

source: pausing all musics
fr: mise en pause des musiques

source: pause wait with id {}
fr: Mettre en pause l'attente d'identifiant {}

source: pause all waits
fr: Mettre en pause toutes les attentes

source: starting « {} » at volume {}%
fr: lance « {} » au volume {}%

source: starting all musics at volume {}%
fr: lance toutes les musiques au volume {}%

source: starting « {} » at {}s at volume {}%
fr: lance « {} » à {}s au volume {}%

source: starting all musics at {}s at volume {}%
fr: lance toutes les musiques à {}s au volume {}%

source: starting « {} » with {}s fade_in at volume {}%
fr: lance « {} » avec un fondu de {}s au volume {}%

source: starting all musics with {}s fade_in at volume {}%
fr: lance toutes les musiques avec un fondu de {}s au volume {}%

source: starting « {} » at {}s with {}s fade_in at volume {}%
fr: lance « {} » à {}s avec un fondu de {}s au volume {}%

source: starting all musics at {}s with {}s fade_in at volume {}%
fr: lance toutes les musiques à {}s avec un fondu de {}s au volume {}%

source: starting « {} » at volume {}% {} times
fr: lance « {} » au volume {}% {} fois

source: starting all musics at volume {}% {} times
fr: lance toutes les musiques au volume {}% {} fois

source: starting « {} » at {}s at volume {}% {} times
fr: lance « {} » à {}s au volume {}% {} fois

source: starting all musics at {}s at volume {}% {} times
fr: lance toutes les musiques à {}s au volume {}% {} fois

source: starting « {} » with {}s fade_in at volume {}% {} times
fr: lance « {} » avec un fondu de {}s au volume {}% {} fois

source: starting all musics with {}s fade_in at volume {}% {} times
fr: lance toutes les musiques avec un fondu de {}s au volume {}% {} fois

source: starting « {} » at {}s with {}s fade_in at volume {}% {} times
fr: lance « {} » à {}s avec un fondu de {}s au volume {}% {} fois

source: starting all musics at {}s with {}s fade_in at volume {}% {} times
fr: lance toutes les musiques à {}s avec un fondu de {}s au volume {}% {} fois

source: starting « {} » at volume {}% in loop
fr: lance « {} » au volume {}% en boucle

source: starting all musics at volume {}% in loop
fr: lance toutes les musiques au volume {}% en boucle

source: starting « {} » at {}s at volume {}% in loop
fr: lance « {} » à {}s au volume {}% en boucle

source: starting all musics at {}s at volume {}% in loop
fr: lance toutes les musiques à {}s au volume {}% en boucle

source: starting « {} » with {}s fade_in at volume {}% in loop
fr: lance « {} » avec un fondu de {}s au volume {}% en boucle

source: starting all musics with {}s fade_in at volume {}% in loop
fr: lance toutes les musiques avec un fondu de {}s au volume {}% en boucle

source: starting « {} » at {}s with {}s fade_in at volume {}% in loop
fr: lance « {} » à {}s avec un fondu de {}s au volume {}% en boucle

source: starting all musics at {}s with {}s fade_in at volume {}% in loop
fr: lance toutes les musiques à {}s avec un fondu de {}s au volume {}% en boucle

source: starting « {} » at volume {}% (restarting if already running)
fr: lance « {} » au volume {}% (redémarre si déjà lancée)

source: starting all musics at volume {}% (restarting if already running)
fr: lance toutes les musiques au volume {}% (redémarre si déjà lancée)

source: starting « {} » at {}s at volume {}% (restarting if already running)
fr: lance « {} » à {}s au volume {}% (redémarre si déjà lancée)

source: starting all musics at {}s at volume {}% (restarting if already running)
fr: lance toutes les musiques à {}s au volume {}% (redémarre si déjà lancée)

source: starting « {} » with {}s fade_in at volume {}% (restarting if already running)
fr: lance « {} » avec un fondu de {}s au volume {}% (redémarre si déjà lancée)

source: starting all musics with {}s fade_in at volume {}% (restarting if already running)
fr: lance toutes les musiques avec un fondu de {}s au volume {}% (redémarre si déjà lancée)

source: starting « {} » at {}s with {}s fade_in at volume {}% (restarting if already running)
fr: lance « {} » à {}s avec un fondu de {}s au volume {}% (redémarre si déjà lancée)

source: starting all musics at {}s with {}s fade_in at volume {}% (restarting if already running)
fr: lance toutes les musiques à {}s avec un fondu de {}s au volume {}% (redémarre si déjà lancée)

source: starting « {} » at volume {}% {} times (restarting if already running)
fr: lance « {} » au volume {}% {} fois (redémarre si déjà lancée)

source: starting all musics at volume {}% {} times (restarting if already running)
fr: lance toutes les musiques au volume {}% {} fois (redémarre si déjà lancée)

source: starting « {} » at {}s at volume {}% {} times (restarting if already running)
fr: lance « {} » à {}s au volume {}% {} fois (redémarre si déjà lancée)

source: starting all musics at {}s at volume {}% {} times (restarting if already running)
fr: lance toutes les musiques à {}s au volume {}% {} fois (redémarre si déjà lancée)

source: starting « {} » with {}s fade_in at volume {}% {} times (restarting if already running)
fr: lance « {} » avec un fondu de {}s au volume {}% {} fois (redémarre si déjà lancée)

source: starting all musics with {}s fade_in at volume {}% {} times (restarting if already running)
fr: lance toutes les musiques avec un fondu de {}s au volume {}% {} fois (redémarre si déjà lancée)

source: starting « {} » at {}s with {}s fade_in at volume {}% {} times (restarting if already running)
fr: lance « {} » à {}s avec un fondu de {}s au volume {}% {} fois (redémarre si déjà lancée)

source: starting all musics at {}s with {}s fade_in at volume {}% {} times (restarting if already running)
fr: lance toutes les musiques à {}s avec un fondu de {}s au volume {}% {} fois (redémarre si déjà lancée)

source: starting « {} » at volume {}% in loop (restarting if already running)
fr: lance « {} » au volume {}% en boucle (redémarre si déjà lancée)

source: starting all musics at volume {}% in loop (restarting if already running)
fr: lance toutes les musiques au volume {}% en boucle (redémarre si déjà lancée)

source: starting « {} » at {}s at volume {}% in loop (restarting if already running)
fr: lance « {} » à {}s au volume {}% en boucle (redémarre si déjà lancée)

source: starting all musics at {}s at volume {}% in loop (restarting if already running)
fr: lance toutes les musiques à {}s au volume {}% en boucle (redémarre si déjà lancée)

source: starting « {} » with {}s fade_in at volume {}% in loop (restarting if already running)
fr: lance « {} » avec un fondu de {}s au volume {}% en boucle (redémarre si déjà lancée)

source: starting all musics with {}s fade_in at volume {}% in loop (restarting if already running)
fr: lance toutes les musiques avec un fondu de {}s au volume {}% en boucle (redémarre si déjà lancée)

source: starting « {} » at {}s with {}s fade_in at volume {}% in loop (restarting if already running)
fr: lance « {} » à {}s avec un fondu de {}s au volume {}% en boucle (redémarre si déjà lancée)

source: starting all musics at {}s with {}s fade_in at volume {}% in loop (restarting if already running)
fr: lance toutes les musiques à {}s avec un fondu de {}s au volume {}% en boucle (redémarre si déjà lancée)

source: reset wait with id {}
fr: Réinitialise l'attente d'identifiant {}

source: reset all waits
fr: Réinitialise toutes les attentes

source: running command {}
fr: lance la commande {}

source: running command {} (waiting for its execution to finish)
fr: lance la commande {} (attend la fin de son exécution)

source: moving music « {} » by {:+d}s
fr: avance la musique « {} » de {:+d}s

source: moving all musics by {:+d}s
fr: avance les musiques de {:+d}s

source: moving music « {} » to position {}s
fr: avance la musique « {} » en position {}s

source: moving all musics to position {}s
fr: avance les musiques en position {}s

source: stopping music « {} »
fr: arrête la musique « {} »

source: stopping all musics
fr: arrête toutes les musiques

source: stopping music « {} » with {}s fadeout
fr: arrête la musique « {} » avec un fadeout de {}s

source: stopping all musics with {}s fadeout
fr: arrête toutes les musiques avec un fadeout de {}s

source: stopping music « {} » with {}s fadeout (waiting the end of fadeout, with id {})
fr: arrête la musique « {} » avec un fadeout de {}s (attend la fin du fadeout, avec l'identifiant {})

source: stopping all musics with {}s fadeout (waiting the end of fadeout, with id {})
fr: arrête toutes les musiques avec un fadeout de {}s (attend la fin du fadeout, avec l'identifiant {})

source: stopping music « {} » with {}s fadeout (waiting the end of fadeout)
fr: arrête la musique « {} » avec un fadeout de {}s (attend la fin du fadeout)

source: stopping all musics with {}s fadeout (waiting the end of fadeout)
fr: arrête toutes les musiques avec un fadeout de {}s (attend la fin du fadeout)

source: stopping all actions
fr: arrête toutes les actions

source: stopping all actions except this key
fr: arrête toutes les actions sauf cette touche

source: unpausing « {} »
fr: reprend « {} »

source: unpausing all musics
fr: reprend toutes les musiques

source: unpause wait with id {}
fr: Reprendre l'attente d'identifiant {}

source: unpause all waits
fr: Reprendre toutes les attentes

source: {:+d}% to volume of « {} »
fr: {:+d}% sur le volume de « {} »

source: {:+d}% to volume
fr: {:+d}% sur le volume global

source: {:+d}% to volume of « {} » with {}s fade
fr: {:+d}% sur le volume de « {} » avec {}s de fade

source: {:+d}% to volume with {}s fade
fr: {:+d}% sur le volume global avec {}s de fade

source: setting volume of « {} » to {}%
fr: changement du volume de « {} » à {}%

source: setting volume to {}%
fr: changement du volume global à {}%

source: setting volume of « {} » to {}% with {}s fade
fr: changement du volume de « {} » à {}% avec {}s de fade

source: setting volume to {}% with {}s fade
fr: changement du volume global à {}% avec {}s de fade

source: waiting {}s
fr: attend {}s

source: waiting the end of « {} »
fr: attend la fin de « {} »

source: waiting the end of « {} » + {}s
fr: attend la fin de « {} » + {}s

source: waiting {}s (setting id = {})
fr: attend {}s (définit l'identifiant {})

source: waiting the end of « {} » (setting id = {})
fr: attend la fin de « {} » (définit l'identifiant {})

source: waiting the end of « {} » + {}s (setting id = {})
fr: attend la fin de « {} » + {}s (définit l'identifiant {})

source: actions linked to key {} (repeat protection {}s):
fr: actions liées à la touche {} (protection de {}s contre les répétitions) :

source: actions linked to key {}:
fr: actions liées à la touche {} :

source: Focus lost!
fr: Focus perdu !
